## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:97" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:97" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:d056ee3a7ca1cc4f5dbda83aeb623beef015b290b841036e1dc3d13fd6a84d2a" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:ca0cddec4a77ba905f18fe64e7d2a7fee1b85cd928ce290f3e2eb3b1b875ba77"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 97 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "1e7a0f68fac6fcb2bb33ec96d2947868-6" -> "904a8c51cee6884bf43de42fe432012c"
        id                     = "graphql.904a8c51cee6884bf43de42fe432012c.zip"
        tags                   = {}
      ~ version_id             = "TlYPpOa2ufjKzZyn4q93ZMomCXfiuRcL" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "b65238d2e7ce637461c8e3bcd74b478f-5" -> "001934362155a5aba63e5809098348b0"
        id                     = "processValidationJson.001934362155a5aba63e5809098348b0.zip"
        tags                   = {}
      ~ version_id             = "2VSIrFDY1S8JXTNpEPP4664ip8SmMPI4" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.f3265eca27c2299ee4e112e1f4c5ca9d.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "619d1926d6875668a88ef4cacb286247-4" -> "206c9802aefc8e9b16f16497f6d19924"
      ~ id                     = "python.f3265eca27c2299ee4e112e1f4c5ca9d.zip" -> (known after apply)
      ~ key                    = "python.f3265eca27c2299ee4e112e1f4c5ca9d.zip" -> "python.206c9802aefc8e9b16f16497f6d19924.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "f3265eca27c2299ee4e112e1f4c5ca9d" -> "206c9802aefc8e9b16f16497f6d19924"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "u3NTz1SKOhS4alQ8Yq7alSVkzhkbMykL" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b6d39d77b3446982066890744df7d810" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/200.html"
      ~ source_hash            = "b6d39d77b3446982066890744df7d810" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "5IGT6ePxfUt3h71sp.TJMlJGzQiEg.cO" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "912075cc8b9298d6dae62ba5012723c3" -> "60867b05c87877a1b51a4b98c9a37c68"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "912075cc8b9298d6dae62ba5012723c3" -> "60867b05c87877a1b51a4b98c9a37c68"
        tags                   = {}
      ~ version_id             = "ShLSEbnpfarkUmcsAiXjbAiz9LZ37QNj" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "8d6e6028fcea99802a44cbac5ab7ee7d" -> "9523f2185ba82b988bbd2521fefab528"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "8d6e6028fcea99802a44cbac5ab7ee7d" -> "9523f2185ba82b988bbd2521fefab528"
        tags                   = {}
      ~ version_id             = "sLuT49c1t5MChlhcBzV_erAb3QIcF8Xf" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b6d39d77b3446982066890744df7d810" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/index.html"
      ~ source_hash            = "b6d39d77b3446982066890744df7d810" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "UNr5S383wQ8ta3yj1qkm5iqjsSRBpuqw" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.bd8bfc99.js"] will be destroyed
  # (because key ["static/js/app.bd8bfc99.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.bd8bfc99.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "86c72c43339043123fed76aabd881609" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.bd8bfc99.js" -> null
-       key                    = "dist/static/js/app.bd8bfc99.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.bd8bfc99.js" -> null
-       source_hash            = "86c72c43339043123fed76aabd881609" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "xh4Wo4FPH3kpBRNqWoRE0dYDikQiAGeV" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.bd8bfc99.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.bd8bfc99.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.bd8bfc99.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.bd8bfc99.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.bd8bfc99.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.bd8bfc99.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "mQBAY1sQ5Jp8gADU1RGRu3HNq4qrSEUm" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-16T20:25:42.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:64" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:64/invocations" -> (known after apply)
      ~ s3_key                         = "python.f3265eca27c2299ee4e112e1f4c5ca9d.zip" -> "python.206c9802aefc8e9b16f16497f6d19924.zip"
        tags                           = {}
      ~ version                        = "64" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "0f88fbc6da46efe59bc4ee8787e9c9f7584415d8" -> "37362fc4892c970b1e67e8e7632fe3b364b9270a"
              ~ "DD_TAGS"                      = "git.commit.sha:0f88fbc6da46efe59bc4ee8787e9c9f7584415d8,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:37362fc4892c970b1e67e8e7632fe3b364b9270a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "0f88fbc6da46efe59bc4ee8787e9c9f7584415d8" -> "37362fc4892c970b1e67e8e7632fe3b364b9270a"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "64" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:112" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:112/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "112" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "0f88fbc6da46efe59bc4ee8787e9c9f7584415d8" -> "37362fc4892c970b1e67e8e7632fe3b364b9270a"
              ~ "DD_TAGS"                            = "git.commit.sha:0f88fbc6da46efe59bc4ee8787e9c9f7584415d8,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:37362fc4892c970b1e67e8e7632fe3b364b9270a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "0f88fbc6da46efe59bc4ee8787e9c9f7584415d8" -> "37362fc4892c970b1e67e8e7632fe3b364b9270a"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "112" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_iam_policy.vpc[0] will be created
+   resource "aws_iam_policy" "vpc" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "cpfreporter-processValidationJson-vpc"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:CreateNetworkInterface",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DeleteNetworkInterface",
+                           "ec2:AssignPrivateIpAddresses",
+                           "ec2:UnassignPrivateIpAddresses",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
    }

  # module.lambda_function-processValidationJson.aws_iam_role_policy_attachment.vpc[0] will be created
+   resource "aws_iam_role_policy_attachment" "vpc" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "cpfreporter-processValidationJson"
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:20/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "20" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
+               "DATABASE_SECRET_SOURCE"             = "ssm"
+               "DATABASE_SECRET_SSM_PARAMETER_PATH" = "/cpfreporter/postgres/master_password"
+               "DATABASE_URL"                       = (sensitive value)
              ~ "DD_COMMIT_SHA"                      = "0f88fbc6da46efe59bc4ee8787e9c9f7584415d8" -> "37362fc4892c970b1e67e8e7632fe3b364b9270a"
              ~ "DD_TAGS"                            = "git.commit.sha:0f88fbc6da46efe59bc4ee8787e9c9f7584415d8,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:37362fc4892c970b1e67e8e7632fe3b364b9270a,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "0f88fbc6da46efe59bc4ee8787e9c9f7584415d8" -> "37362fc4892c970b1e67e8e7632fe3b364b9270a"
                # (13 unchanged elements hidden)
            }
        }

+       vpc_config {
+           ipv6_allowed_for_dual_stack = false
+           security_group_ids          = [
+               "sg-088d54ce85f679ac1",
+               "sg-0ac4f2c8cfc0c58bc",
            ]
+           subnet_ids                  = (sensitive value)
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "20" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8712215236)*